app/Controllers/ProductoController.php

    public function index()
    {
        $productos = $this->productoModel->findAll();
---
SELECT *
FROM `productos`

    public function tabla()
    {
        $productos = $this->productoModel->where('eliminado', 'no')->findAll();
---
SELECT `productos`.*, `categorias`.`descripcion` AS `nombre_cat`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`categoria_id`
WHERE `productos`.`eliminado` = 'no'